Tekla Open API Reference for Tekla Structures 2025
OBB.ComputeVertices Method
 Calculates the corner points of the OBB.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point[] ComputeVertices()
Public Function ComputeVertices As Point()
Return Value
Type: Point[]
Array of corner points.
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace